# StairsRunActualNumberOfTreads Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsRunActualNumberOfTreads Property
ParameterTypeId Class See Also
---
"Actual Number of Treads": Actual Number of Treads
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsRunActualNumberOfTreads { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsRunActualNumberOfTreads As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsRunActualNumberOfTreads {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace